
var добавить_таблицу = function()
{
    alert("Hello")
    var подраздел = document.createElement('div')
    подраздел.id = 'подраздел_документа'
    подраздел.className = 'подраздел_документа_актив'
    document.body.appendChild(подраздел)

    var тело_подраздела_таблица = document.createElement('div')
    тело_подраздела_таблица.className = 'тело_подраздела_таблица'
    подраздел.appendChild(тело_подраздела_таблица)

    var колонка_таблицы_нумерация = document.createElement('div')
    колонка_таблицы_нумерация.id = 'колонка_таблицы_нумерация'
    колонка_таблицы_нумерация.className = 'колонка_таблицы'
    тело_подраздела_таблица.appendChild(колонка_таблицы_нумерация)

    var строка_таблицы = document.createElement('div')
    строка_таблицы.id = 'строка_таблицы'
    строка_таблицы.className = 'строка_таблицы_неакт'
    колонка_таблицы_нумерация.appendChild(строка_таблицы)

    var тело_колонки = document.createElement('div')
    тело_колонки.className = 'тело_колонки'
    колонка_таблицы_нумерация.appendChild(тело_колонки)

    var строка_таблицы = document.createElement('div')
    строка_таблицы.id = 'строка_таблицы'
    строка_таблицы.className = 'строка_таблицы_неакт'
    тело_колонки.appendChild(строка_таблицы)

    var главная_колонка_таблицы = document.createElement('div')
    главная_колонка_таблицы.id = 'главная_колонка_таблицы'
    главная_колонка_таблицы.className = 'колонка_таблицы'
    тело_подраздела_таблица.appendChild(главная_колонка_таблицы)

    var строка_таблицы = document.createElement('div')
    строка_таблицы.id = 'строка_таблицы'
    строка_таблицы.className = 'строка_таблицы_неакт'
    строка_таблицы.textContent = 'список'
    главная_колонка_таблицы.appendChild(строка_таблицы)

    var тело_колонки = document.createElement('div')
    тело_колонки.className = 'тело_колонки'
    главная_колонка_таблицы.appendChild(тело_колонки)

    var строка_таблицы = document.createElement('div')
    строка_таблицы.id = 'строка_таблицы'
    строка_таблицы.className = 'строка_таблицы_неакт'
    строка_таблицы.textContent = 'имя'
    тело_колонки.appendChild(строка_таблицы)

    var колонка_таблицы = document.createElement('div')
    колонка_таблицы.id = 'колонка_таблицы_1'
    колонка_таблицы.className = 'колонка_таблицы'
    тело_подраздела_таблица.appendChild(колонка_таблицы)

    var строка_таблицы = document.createElement('div')
    строка_таблицы.id = 'строка_таблицы'
    строка_таблицы.className = 'строка_таблицы_неакт'
    строка_таблицы.textContent = 'свойство'
    колонка_таблицы.appendChild(строка_таблицы)

    var тело_колонки = document.createElement('div')
    тело_колонки.className = 'тело_колонки'
    колонка_таблицы.appendChild(тело_колонки)

    var строка_таблицы = document.createElement('div')
    строка_таблицы.id = 'строка_таблицы'
    строка_таблицы.className = 'строка_таблицы_неакт'
    строка_таблицы.textContent = 'значение'
    тело_колонки.appendChild(строка_таблицы)

    подраздел.onclick = function()
    {
        редактировать_таблицу(this.querySelector('.тело_подраздела_таблица'))
    }
}